Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAMV71Q19.xml
        <register caption="Transmit Buffer Queue Base Address Register" name="GMAC_TBQB" offset="0x01C" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0xFFFFFFFC" name="ADDR"/>
        </register>
        <register caption="Receive Status Register" name="GMAC_RSR" offset="0x020" rw="RW" size="4">
          <bitfield caption="Buffer Not Available" mask="0x00000001" name="BNA"/>
          <bitfield caption="Frame Received" mask="0x00000002" name="REC"/>
          <bitfield caption="Receive Overrun" mask="0x00000004" name="RXOVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000008" name="HNO"/>
        </register>
        <register caption="Interrupt Status Register" name="GMAC_ISR" offset="0x024" rw="R" size="4">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
          <bitfield caption="TSU Seconds Register Increment" mask="0x04000000" name="SRI"/>
          <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
        </register>
        <register caption="Interrupt Enable Register" name="GMAC_IER" offset="0x028" rw="W" size="4">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
          <bitfield caption="TSU Seconds Register Increment" mask="0x04000000" name="SRI"/>
          <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
        </register>
        <register caption="Interrupt Disable Register" name="GMAC_IDR" offset="0x02C" rw="W" size="4">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
          <bitfield caption="TSU Seconds Register Increment" mask="0x04000000" name="SRI"/>
          <bitfield caption="Wake On LAN" mask="0x10000000" name="WOL"/>
        </register>
        <register caption="Interrupt Mask Register" name="GMAC_IMR" offset="0x030" rw="RW" size="4">
          <bitfield caption="Management Frame Sent" mask="0x00000001" name="MFS"/>
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="TX Used Bit Read" mask="0x00000008" name="TXUBR"/>
          <bitfield caption="Transmit Underrun" mask="0x00000010" name="TUR"/>
          <bitfield caption="Retry Limit Exceeded" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
          <bitfield caption="Pause Frame with Non-zero Pause Quantum Received" mask="0x00001000" name="PFNZ"/>
          <bitfield caption="Pause Time Zero" mask="0x00002000" name="PTZ"/>
          <bitfield caption="Pause Frame Transmitted" mask="0x00004000" name="PFTR"/>
          <bitfield caption="External Interrupt" mask="0x00008000" name="EXINT"/>
          <bitfield caption="PTP Delay Request Frame Received" mask="0x00040000" name="DRQFR"/>
          <bitfield caption="PTP Sync Frame Received" mask="0x00080000" name="SFR"/>
          <bitfield caption="PTP Delay Request Frame Transmitted" mask="0x00100000" name="DRQFT"/>
          <bitfield caption="PTP Sync Frame Transmitted" mask="0x00200000" name="SFT"/>
          <bitfield caption="PDelay Request Frame Received" mask="0x00400000" name="PDRQFR"/>
          <bitfield caption="PDelay Response Frame Received" mask="0x00800000" name="PDRSFR"/>
          <bitfield caption="PDelay Request Frame Transmitted" mask="0x01000000" name="PDRQFT"/>
          <bitfield caption="PDelay Response Frame Transmitted" mask="0x02000000" name="PDRSFT"/>
        </register>
        <register caption="PHY Maintenance Register" name="GMAC_MAN" offset="0x034" rw="RW" size="4">
          <bitfield caption="PHY Data" mask="0x0000FFFF" name="DATA"/>
          <bitfield caption="Write Ten" mask="0x00030000" name="WTN"/>
          <bitfield caption="Register Address" mask="0x007C0000" name="REGA"/>
          <bitfield caption="PHY Address" mask="0x0F800000" name="PHYA"/>
          <bitfield caption="Operation" mask="0x30000000" name="OP"/>
          <bitfield caption="Clause 22 Operation" mask="0x40000000" name="CLTTO"/>
          <bitfield caption="Write ZERO" mask="0x80000000" name="WZO"/>
        </register>
        <register caption="Received Pause Quantum Register" name="GMAC_RPQ" offset="0x038" rw="R" size="4">
          <bitfield caption="Received Pause Quantum" mask="0x0000FFFF" name="RPQ"/>
        </register>
        <register caption="Transmit Pause Quantum Register" name="GMAC_TPQ" offset="0x03C" rw="RW" size="4">
          <bitfield caption="Transmit Pause Quantum" mask="0x0000FFFF" name="TPQ"/>
        </register>
        <register caption="TX Partial Store and Forward Register" name="GMAC_TPSF" offset="0x040" rw="RW" size="4">
          <bitfield caption="Transmit Partial Store and Forward Address" mask="0x00000FFF" name="TPB1ADR"/>
          <bitfield caption="Enable TX Partial Store and Forward Operation" mask="0x80000000" name="ENTXP"/>
        </register>
        <register caption="RX Partial Store and Forward Register" name="GMAC_RPSF" offset="0x044" rw="RW" size="4">
          <bitfield caption="Receive Partial Store and Forward Address" mask="0x00000FFF" name="RPB1ADR"/>
          <bitfield caption="Enable RX Partial Store and Forward Operation" mask="0x80000000" name="ENRXP"/>
        </register>
        <register caption="RX Jumbo Frame Max Length Register" name="GMAC_RJFML" offset="0x048" rw="RW" size="4">
          <bitfield caption="Frame Max Length" mask="0x00003FFF" name="FML"/>
        </register>
        <register caption="Hash Register Bottom" name="GMAC_HRB" offset="0x080" rw="RW" size="4">
          <bitfield caption="Hash Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
        <register caption="Hash Register Top" name="GMAC_HRT" offset="0x084" rw="RW" size="4">
          <bitfield caption="Hash Address" mask="0xFFFFFFFF" name="ADDR"/>
        </register>
